 Table of Content 
1.Importing libaries 
2.importing the data set
3.data wrangeling (Task 4)
4.Completing the fundamental data quality and consistency checks (Task 5)
5.changing data types
6.looking for mixed data type columns in the df
7.Finding missing entries
8.Looking for full duplicates
9.Combining the customer data with the rest of the prepared Instacart data (Task 6) 
10.Exporting the data set

## Importing libaries

In [2]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

## importing the dataset¶

In [3]:
cust=pd.read_csv(r'/Users/bente/careerfoundry /exercise 4/Ex.4_25-10-2023 Instacart Basket Analysis/02 Data/Original Data/customers.csv', index_col = False)

## data wrangeling (Task 4 )

In [4]:
#Wrangle the data so that it follows consistent logic; for example, rename columns with illogical 
#names and drop columns that don’t add anything to your analysis.

In [5]:
cust.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [6]:
cust.rename(columns={'STATE': 'State'}, inplace=True)

In [7]:
cust.rename(columns={'date_joined': 'Joining Date'}, inplace=True)

In [8]:
cust.rename(columns={'n_dependants': 'Dependants'}, inplace=True)

In [33]:
cust.rename(columns={'fam_status': 'Family Status'}, inplace=True)

In [10]:
# in case I want to drop a column: 
#cust.drop(columns='column_to_delete', inplace=True)

In [11]:
cust.head(10)

,user_id,First Name,Surnam,Gender,State,Age,Joining Date,Dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [12]:
cust.rename(columns={'user_id': 'User Id'}, inplace=True)

In [13]:
cust.rename(columns={'fam_status': 'Family_status'}, inplace=True)

In [14]:
cust.rename(columns={'income': 'Income'}, inplace=True)

In [22]:
cust.rename(columns={'Family_status': 'Family Status'}, inplace=True)

In [28]:
cust.head(10)

,User Id,First Name,Surname,Gender,State,Age,Joining Date,Dependants,Family Status,Income,First Name
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,Deborah
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285,Patricia
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568,Kenneth
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049,Michelle
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374,Ann
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643,Cynthia
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746,Chris
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712,Joseph
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432,Jeremy
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072,Shawn

## Completing the fundamental data quality and consistency checks (Task 5)

In [17]:
#Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; 
#for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [103]:
cust['First Name'] = cust['First Name'].astype('str')

In [18]:
cust.dtypes

User Id           int64
First Name       object
Surname          object
Gender           object
State            object
Age               int64
Joining Date     object
Dependants        int64
Family_status    object
Income            int64
dtype: object

## changing data types

In [19]:
#changing the data type "object" to string to make sure it contains no mixed values

In [20]:
cust['First Name'] = cust['First Name'].astype('str')

In [21]:
cust['Surname'] = cust['Surname'].astype('str')

In [24]:
cust['Gender'] = cust['Gender'].astype('str')

In [25]:
cust['State'] = cust['State'].astype('str')

In [26]:
cust['Joining Date'] = cust['Joining Date'].astype('str')

In [29]:
cust['Family Status'] = cust['Family Status'].astype('str')

In [98]:
cust['User Id'] = cust['User Id'].astype('str')

I decided to not drop any columns since i dont know yet if i will need them later

## looking for mixed data type columns in the df

In [106]:
#I didnt find an approach in the last exercises how to find mixed data. Therefore i googled and tried this approach: 

# Check for mixed data types in each column of the DataFrame 'customers'
mixed_types_per_column = cust.applymap(type)

# Identify columns with mixed data types
columns_with_mixed_types = mixed_types_per_column.apply(lambda x: len(set(x))) > 1
columns_with_mixed_types = columns_with_mixed_types[columns_with_mixed_types].index.tolist()

# Display columns with mixed data types
print("Columns with mixed data types:")
print(columns_with_mixed_types)

/var/folders/3b/250d_ncn2cb7rf34jj9d3gl40000gq/T/ipykernel_56649/2419388362.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  mixed_types_per_column = cust.applymap(type)

Columns with mixed data types:
[]

There are no columns with mixed data type. Could be because I changed some of them beforehand.

Question: is there an easier or "more intuitive"  approach?

## Finding missing entries

In [76]:
# Count occurrences of each 'User Id'
user_id_counts = cust['User Id'].value_counts(dropna=False)

In [72]:
user_id_counts

User Id
26711     1
67322     1
173044    1
61044     1
98344     1
         ..
146847    1
154991    1
172193    1
184326    1
80148     1
Name: count, Length: 206209, dtype: int64

In [69]:
# Filter 'User Id's with counts greater than 1 (multiple entries)
multiple_entries = user_id_counts[user_id_counts > 1]

In [70]:
# Display 'User Id's with multiple entries
print("User Ids with multiple entries:")
print(multiple_entries)

User Ids with multiple entries:
Series([], Name: count, dtype: int64)

now with "First Name"

In [ ]:
# Count occurrences of each 'First Name' value 
first_name_counts = cust['First Name'].value_counts(dropna=False)

In [79]:
first_name_counts

First Name
NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: count, Length: 208, dtype: int64

-> 11259 Nan entries

Another approach:

In [ ]:
#count the number of missing (NaN) entries in the 'User Id' column after using value_counts(dropna=False)
#use the isna() method in combination with sum() to count the total number of missing values in that column
missing_values_count = cust['First Name'].isna().sum()

In [80]:
missing_values_count

11259

Another approach for the whole dataframe instead of just the user id or First Name column:

In [71]:
cust.isnull().sum()

User Id              0
First Name       11259
Surname              0
Gender               0
State                0
Age                  0
Joining Date         0
Dependants           0
Family Status        0
Income               0
First Name           0
dtype: int64

-> First Name column has 11259 missing values 
-> I will leave it as it is, because I dont need the first Name yet ( decided later to create a df without missing values for just in case, wont hurt :D )

In [59]:
#creating a data frame with only rows where the missing values are located 
df_nan=cust[cust['First Name'].isnull()== True]

Another possibility of treating the missing "First Name" Values would be creating a dataframe without 
missing values. I will do that in case I need it later.

In [81]:
#creating a df without missing value rows 
cust_no_nan= cust.dropna()

In [85]:
cust_no_nan.shape

(194950, 11)

In [86]:
cust.shape

(206209, 11)

In [87]:
206209-194950

11259

-> since the count of rows from the original data frame minus the count of the rows of the missing values data frame
is 11259, the same number like the number of rows with missing entries, the cust_no_nan df is most likely right.

## Looking for full duplicates

In [91]:
cust_dups = cust[cust.duplicated()]

In [92]:
cust_dups

Empty DataFrame
Columns: [User Id, First Name, Surname, Gender, State, Age, Joining Date, Dependants, Family Status, Income, First Name ]
Index: []

-> no full duplicates

# Combining the customer data with the rest of the prepared Instacart data (Task 6)

Combine your customer data with the rest of your prepared Instacart data. 
(Hint: Make sure the key columns are the same data type!)

In [95]:
#importing the rest of the prepared Instacart data ('ords_prods_merge_4.8.pkl')
ords_prods_merge=pd.read_pickle(r'/Users/bente/careerfoundry /exercise 4/Ex.4_25-10-2023 Instacart Basket Analysis/02 Data/Prepared Data/ords_prods_merge_4.8.pkl')

In [96]:
#checking the data types 
ords_prods_merge.dtypes

product_id                 int64
product_name              object
aisle_id                   int64
department_id              int64
prices                   float64
order_id                   int64
user_id                   object
order_number               int64
orders_day_of_week         int64
order_hour_of_day          int64
days_since_last_order    float64
customer_type             object
add_to_cart_order          int64
reordered                  int64
price_range_loc           object
busiest_day               object
busiest_days              object
busiest_period_of_day     object
max_order                  int64
loyalty_flag              object
user_mean_price          float64
spending_type             object
order_frequency          float64
frequency_flag            object
dtype: object

In [99]:
#checking the data types 
cust.dtypes

User Id          object
First Name       object
Surname          object
Gender           object
State            object
Age               int64
Joining Date     object
Dependants        int64
Family Status    object
Income            int64
First Name       object
dtype: object

In [100]:
ords_prods_merge.describe

<bound method NDFrame.describe of           product_id                product_name  aisle_id  department_id  \
0                  1  Chocolate Sandwich Cookies        61             19
1                  1  Chocolate Sandwich Cookies        61             19
2                  1  Chocolate Sandwich Cookies        61             19
3                  1  Chocolate Sandwich Cookies        61             19
4                  1  Chocolate Sandwich Cookies        61             19
...              ...                         ...       ...            ...
32404854       49688      Fresh Foaming Cleanser        73             11
32404855       49688      Fresh Foaming Cleanser        73             11
32404856       49688      Fresh Foaming Cleanser        73             11
32404857       49688      Fresh Foaming Cleanser        73             11
32404858       49688      Fresh Foaming Cleanser        73             11

          prices  order_id user_id  order_number  orders_day_of_week  \
0            5.8   3139998     138            28                   6
1            5.8   1977647     138            30                   6
2            5.8    389851     709             2                   0
3            5.8    652770     764             1                   3
4            5.8   1813452     764             3                   4
...          ...       ...     ...           ...                 ...
32404854    13.5   1788356  200215             2                   0
32404855    13.5   3401313  200377             1                   4
32404856    13.5    809510  200873             5                   3
32404857    13.5   2359893  200873             9                   3
32404858    13.5   2385091  205926            11                   1

          order_hour_of_day  ...    price_range_loc     busiest_day  \
0                        11  ...  Mid-range product  Regularly busy
1                        17  ...  Mid-range product  Regularly busy
2                        21  ...  Mid-range product     Busiest day
3                        13  ...  Mid-range product  Regularly busy
4                        17  ...  Mid-range product      Least busy
...                     ...  ...                ...             ...
32404854                  9  ...  Mid-range product     Busiest day
32404855                 11  ...  Mid-range product      Least busy
32404856                  8  ...  Mid-range product  Regularly busy
32404857                 15  ...  Mid-range product  Regularly busy
32404858                 15  ...  Mid-range product  Regularly busy

            busiest_days  busiest_period_of_day max_order      loyalty_flag  \
0         Regularly busy            Most orders        32  Regular customer
1         Regularly busy         Average orders        32  Regular customer
2           Busiest days         Average orders         5      New customer
3             Least busy            Most orders         3      New customer
4             Least busy         Average orders         3      New customer
...                  ...                    ...       ...               ...
32404854    Busiest days            Most orders         6      New customer
32404855      Least busy            Most orders         4      New customer
32404856      Least busy         Average orders        20  Regular customer
32404857      Least busy            Most orders        20  Regular customer
32404858    Busiest days            Most orders        11  Regular customer

         user_mean_price spending_type  order_frequency         frequency_flag
0               6.935811   Low spender              8.0      Frequent customer
1               6.935811   Low spender              8.0      Frequent customer
2               7.930208   Low spender              8.0      Frequent customer
3               4.972414   Low spender              9.0      Frequent customer
4               4.972414   Low spender              9.0      Frequent customer
...                  ...           ...              ...                    ...
32404854        8.220313   Low spender              7.0      Frequent customer
32404855        7.364516   Low spender             30.0  Non-frequent customer
32404856        8.500344   Low spender              6.0      Frequent customer
32404857        8.500344   Low spender              6.0      Frequent customer
32404858        8.133333   Low spender              6.0      Frequent customer

[32404859 rows x 24 columns]>

In [101]:
cust.describe

<bound method NDFrame.describe of        User Id First Name   Surname  Gender           State  Age Joining Date  \
0        26711    Deborah  Esquivel  Female        Missouri   48     1/1/2017
1        33890   Patricia      Hart  Female      New Mexico   36     1/1/2017
2        65803    Kenneth    Farley    Male           Idaho   35     1/1/2017
3       125935   Michelle     Hicks  Female            Iowa   40     1/1/2017
4       130797        Ann   Gilmore  Female        Maryland   26     1/1/2017
...        ...        ...       ...     ...             ...  ...          ...
206204  168073       Lisa      Case  Female  North Carolina   44     4/1/2020
206205   49635     Jeremy   Robbins    Male          Hawaii   62     4/1/2020
206206  135902      Doris  Richmond  Female        Missouri   66     4/1/2020
206207   81095       Rose   Rollins  Female      California   27     4/1/2020
206208   80148    Cynthia     Noble  Female        New York   55     4/1/2020

        Dependants Family Status  Income First Name
0                3       married  165665     Deborah
1                0        single   59285    Patricia
2                2       married   99568     Kenneth
3                0        single   42049    Michelle
4                1       married   40374         Ann
...            ...           ...     ...         ...
206204           1       married  148828        Lisa
206205           3       married  168639      Jeremy
206206           2       married   53374       Doris
206207           1       married   99799        Rose
206208           1       married   57095     Cynthia

[206209 rows x 11 columns]>

In [129]:
#in order to have the key columns with the same name I will rename "user_id" to "User Id"
ords_prods_merge.rename(columns={'user_id': 'User Id'}, inplace=True)

In [130]:
#using a inner join to merge the both sets and creating acreate an additional column that indicates the 
#source of the data within that row. 
ords_prods_custs_merge = ords_prods_merge.merge(cust, on = 'User Id', indicator = True)

In [131]:
#checking the new df for match 
ords_prods_custs_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [132]:
#finding out how many rows the new df has 
row_count = len(ords_prods_custs_merge)
print(row_count)

32404859

In [133]:
# Checking inner merge matches by looking at outer merge
merge_check = ords_prods_merge.merge(cust, on = 'User Id', indicator = True, how = 'outer')

In [134]:
#checking the new df matches 
ords_prods_custs_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

-> Both dataframes have full match.

## Exporting the data set

In [136]:
path = '/Users/bente/careerfoundry /exercise 4/Ex.4_25-10-2023 Instacart Basket Analysis'

In [137]:
ords_prods_custs_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_custs_merge.pkl'))